{
    "articles": [
        {
            "id": 1,
            "component": "ArticleProfile",
            "locales": {},
            "settings": {
                "order_items_by": "id",
                "order_items_sort": "asc",
                "contact_list_ids": [
                    "address",
                    "email",
                    "phone"
                ],
                "contact_circles_ids": [
                    "instagram",
                    "facebook",
                    "linkedin",
                    "github",
                    "wechat"
                ]
            },
            "items": [
                {
                    "id": 1,
                    "locales": {
                        "en": {
                            "description": "In code, pursue flawless precision; in life, cherish the beauty of flaws."
                        },
                        "es": {
                            "description": "Llevo 8 años trabajando como diseñador UX, creando interfaces intuitivas, fluidas y fáciles de usar en distintos dispositivos. Me apasiona diseñar experiencias digitales que no solo sean atractivas, sino que también funcionen sin esfuerzo, haciendo que la interacción sea más fluida y agradable."
                        },
                        "fr": {
                            "description": "Depuis 8 ans, je conçois des interfaces UX intuitives, naturelles et fluides sur différents appareils. Ce qui me passionne, c'est de créer des expériences numériques qui sont non seulement esthétiques, mais aussi parfaitement fonctionnelles, rendant chaque interaction plus fluide et agréable."
                        },
                        "zh": {
                            "description": "工作中追求「零 bug」的严谨，生活中允许「不完美」的松弛。"
                        }
                    }
                },
                {
                    "id": 2,
                    "locales": {
                        "en": {
                            "description": "5 years of frontend development experience with a focus on user interaction implementation for web applications. Contributed to projects across healthcare, energy, and other industries, taking charge of designing interactive logic and optimizing performance for frontend interfaces. Continuously learning framework features and UX design principles through hands-on practice, aiming to further enhance technical capabilities and contribute to refining product interaction experiences in new projects."
                        },
                        "zh": {
                            "description": "5 年前端开发经验，专注于 Web 应用的用户交互实现。参与过医疗、电力等行业的项目开发，负责过前端页面的交互逻辑设计与性能优化，在实践中不断学习框架特性和用户体验设计原则，希望能在新的项目中继续提升技术能力，为产品交互体验的优化提供支持。"
                        }
                    }
                }
            ]
        }
    ]
}